ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/libraries/cc13xx_pg1_init_lib/cc13xx_pg1_init_lib.c
/******************************************************************************
*  Filename:       cc13xx_pg1_init_lib.c
*  Revised:        
*  Revision:       
*
*  Description:    Initialization and configuration library for PG1 of CC13xx
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

/**************************************************************************//**
* @addtogroup per_test
* @{
******************************************************************************/

/******************************************************************************
* INCLUDES
*/
#include "stdlib.h"
#include "stdint.h"
#include "string.h" // memset
#include "stdbool.h"

#include "cc13xx_init_lib.h"

#include "synthcal_lib.h"

#include "hw_aon_rtc.h"
#include "hw_aux_wuc.h"
#include "hw_aon_wuc.h"
//#include "hw_aon_sysctrl12.h"
#include "hw_ints.h"
#include "hw_prcm.h"
#include "hw_types.h"
#include "hw_nvic.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "hw_ioc.h"
#include "hw_adi.h"
#include "hw_ddi.h"
#include "hw_adi_2_refsys.h"
#include "hw_adi_3_refsys.h"
#include "hw_adi_4_aux.h"
#include "hw_fcfg1.h"
//#include "hw_factory_cfg.h"
//#include "hw_rf24_dbell.h"
//#include "hw_rf24_pwr.h"
#include "hw_rfc_dbell.h"
#include "hw_rfc_pwr.h"
#include "hw_adi_0_rf.h"
#include "inc/hw_adi_1_synth.h"
#include "inc/pg1/hw_osc_dig.h"
#include "hw_aon_batmon.h"
//#include "hw_rf24_fsca.h"
//#include "hw_rf24_mdm.h"

#include "prcm.h"
#include "gpio.h"
#include "cpu.h"
#include "osc.h"
#include "aux_wuc.h"
#include "aon_wuc.h"
#include "aon_event.h"
#include "interrupt.h"
#include "aon_rtc.h"
#include "pwr_ctrl.h"
#include "ddi.h"
#include "adi.h"
#include "ioc.h"

//#include "common_cmd.h"
#include "cc26xx_pg2/common_cmd_pg2.h"
#include "radio_par.h"

/******************************************************************************
* CONSTANTS AND DEFINES
*/

/* If using GPRAM as RAM then the command structures needs to be placed in a
 * special memory area reserved in SRAM (as ROM) for special variables. The
 * reason for this is that otherwise the CPE will reject the command with an
 * 'invalid pointer' exception, since it does not support command structs in
 * GPRAM. */
#if defined(RUN_FROM_RAM)
  #pragma message("Saving RF commands in RF_CMD_MEM_LOCATION instead of RAM.")
  #define RF_CMD_MEM_LOCATION     @ "SRAM_VAR_AREA"
#else
  #define RF_CMD_MEM_LOCATION
#endif

/* If ROM is GPRAM this is needed to fit the code */
#if defined(RUN_FROM_RAM)
  #define SECONDARY_CODE_AREA "RAM_CODE_AREA"
#endif

// 'Magic' trim value
#define FINAL_TRIM_DONE               0xC5

/******************************************************************************
* LOCAL VARIABLES
*/

static uint8_t pllCorrectionDone = 0;

/******************************************************************************
* GLOBAL VARIABLES
*/

/******************************************************************************
* LOCAL FUNCTION PROTOTYPES
*/
static void manualBootTrim(void);
static uint32_t getCorrectPllFrequency(uint32_t frequency, enum InitLibSynthMode synthMode, enum InitLibRadioMode radioMode);
static void runFractionalResamplerBugFix(uint8_t divider);
static uint_fast8_t RfSendCommandOk( uint32_t CMDR_val, uint32_t * pCMDSTA_val );


//The original file can be found in the cc13xx_app_ex_rev_1_2_1 project
//The functions below have been adapted for use with the CC26xx

/*void InitLib_startUpTrimming(void)
{
    uint32_t ui32Trim;
    uint32_t ui32Reg;
    uint32_t ui32ResetEvents;

    //
    // Check if trimming is required
    //
    if(HWREGB(ADI3_BASE + ADI_3_REFSYS_O_ADI3_SPARE3) != FINAL_TRIM_DONE)
    {
        //
        // Force AUX on and enable clocks
        //
        // No need to save the current status of the power/clock registers.
        // At this point both AUX and AON should have been reset to 0x0.
        //        
        HWREG(AON_WUC_BASE + AON_WUC_O_AUXEVENT) = AON_WUC_AUXEVENT_FORCEON;
        HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN) = AUX_WUC_MODCLKEN_OSCCTRL;

        // --- DCDC 1A trim ---
        // Set VDDR to 1.7V
        //
        // -- Disable reset sources while trimming
        ui32ResetEvents = HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET);
        HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET) = 0x00;
        // Patric Cruise: Make this staircase this because  applying large step in
        // VDDR can cause system reset
        // TBD : The final value is device dependent!!!
        ADI8SetValBit(ADI3_BASE, ADI_3_REFSYS_O_DCDC_CTRL_1,
                      ADI_3_REFSYS_DCDC_CTRL_1_VDDR_TRIM_3P3V_M,0x01);
        ADI8SetValBit(ADI3_BASE, ADI_3_REFSYS_O_DCDC_CTRL_1,
                      ADI_3_REFSYS_DCDC_CTRL_1_VDDR_TRIM_3P3V_M,0x03);
        ADI8SetValBit(ADI3_BASE, ADI_3_REFSYS_O_DCDC_CTRL_1,
                      ADI_3_REFSYS_DCDC_CTRL_1_VDDR_TRIM_3P3V_M,0x05);
        // ----- Default trim sequence end, re-enable reset sources -----
        HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET) = ui32ResetEvents;

        //
        // Following sequence is required for using XTAL, if not included
        // devices crashes when trying to switch to XTAL.
        //
        ui32Reg = HWREG(FCFG1_BASE + FACTORY_CFG_O_CONFIG_OSC_TOP);

        // Ryan Smith: If this register is zero the boot process should be halted!
        // TBD - is this a likely scenario???
        if(ui32Reg == 0)
        {
            while(1);
        }
        // Sets CAP SETTINGS
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_ANABYPASS_VALUE1, 0x000F0FFF);

