ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/libraries/cc13xx_pg1_init_lib/cc13xx_pg1_init_lib.c
        // Sets default RCOSC_LF trim
        ui32Trim = (ui32Reg & FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_M) >>
            FACTORY_CFG_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_S;
        DDI16BitfieldWrite(AUX_OSCDDI_BASE, OSC_DIG_O_XOSCLF_RCOSCLF_CTRL,
                           OSC_DIG_XOSCLF_RCOSCLF_CTRL_RCOSCLF_CTUNE_TRIM_M,
                           OSC_DIG_XOSCLF_RCOSCLF_CTRL_RCOSCLF_CTUNE_TRIM_S,
                           ui32Trim);
        // Sets XOSCHF IBIAS THERM
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_ANABYPASS_VALUE2, 0x000003FF);
        // Sets AMPCOMP settings for switching to XOSCHF
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_AMPCOMP_TH2, 0x68880000);
        // Sets AMPCOMP settings for switching to XOSCHF
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_AMPCOMP_TH1, 0x886876A4);
        // Sets AMPCOMP settings for switching to XOSCHF
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_AMPCOMP_CTRL, 0x00713F27);
        // TBD : What does this do???
        DDI32RegWrite(AUX_OSCDDI_BASE, OSC_DIG_O_RADC_EXTERNAL_CFG, 0x403F4000);

        // Disable clock for OSC_DIG and release power on AUX
        HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN) = 0x0;
        HWREG(AON_WUC_BASE + AON_WUC_O_AUXEVENT) = 0x0;

        // Make sure to flag that trim has been performed
        HWREGB(ADI3_BASE + ADI_3_REFSYS_O_ADI3_SPARE3) = FINAL_TRIM_DONE;
    }
    
    //
    // Check if IREFs must be enabled to avoid kickback...
    // Should only be necessary after POR.
    //
    if(!(HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDC_CTRL_3) & 
         ADI_3_REFSYS_DCDC_CTRL_3_EN_DMY_3P3V))
    {
        //
        // Force AUX on and enable clocks
        //
        // No need to save the current status of the power/clock registers.
        // At this point both AUX and AON should have been reset to 0x0.
        //        
        HWREG(AON_WUC_BASE + AON_WUC_O_AUXEVENT) = AON_WUC_AUXEVENT_FORCEON;
        HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN) = AUX_WUC_MODCLKEN_OSCCTRL |
                                                   AUX_WUC_MODCLKEN_AUX_ADI;

        //
        // Enable IREF in the DCDC - needed to avoid kickback which will potentially
        // trick the frequency doubler in to locking to a lower harmonic.
        //
        HWREGB(ADI3_BASE + ADI_O_SET + ADI_3_REFSYS_O_DCDC_CTRL_3) = 
            ADI_3_REFSYS_DCDC_CTRL_3_EN_DMY_3P3V;

        //
        // Enable IREF in the SOC LDO - needed to avoid kickback which will
        // potentially trick the frequency doubler in to locking to a lower
        // harmonic.
        //
        HWREGB(ADI2_BASE + ADI_O_SET + ADI_2_REFSYS_O_SOCLDO_1_0) = 
            ADI_2_REFSYS_SOCLDO_1_0_EN_IPTAT;

        //
        // Enable IREF in the XOSCHF - needed to avoid kickback which will
        // potentially trick the frequency doubler in to locking to a lower
        // harmonic.
        //
        HWREGH(AUX_OSCDDI_BASE + DDI_O_SET + OSC_DIG_O_XOSCHF_CTRL) = 
            OSC_DIG_XOSCHF_CTRL_XOSCHF_HPBUFF_IREF_OVERRIDE |
                OSC_DIG_XOSCHF_CTRL_XOSCHF_PEAKDET_IPTAT_OVERRIDE;

        //
        // Enable IREF in the ADC - needed to avoid kickback which will potentially
        // trick the frequency doubler in to locking to a lower harmonic.
        //
        HWREGB(AUX_ADI_BASE + ADI_O_SET + ADI_4_AUX_O_CTL2_2_ADC_REF) = 
            ADI_4_AUX_CTL2_2_ADC_REF_REF_IVREF_EN |
                ADI_4_AUX_CTL2_2_ADC_REF_REF_IREF_EN;
        HWREGB(AUX_ADI_BASE + ADI_O_SET + ADI_4_AUX_O_CTL2_0_ADC) = 
            ADI_4_AUX_CTL2_0_ADC_IREF_EN;

        //
        // Disable clock for OSC_DIG and release power on AUX
        //
        HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN) = 0x0;
        HWREG(AON_WUC_BASE + AON_WUC_O_AUXEVENT) = 0x0;
    }
    
#if defined(RUN_FROM_RAM)
#pragma message("Including initialization of moving NVIC table in RAM")
    HWREG(NVIC_VTABLE) = 0x20000000;
#endif
    
    // Manual boot trim, due to non-functioning boot ROM
#if defined(DO_MANUAL_TRIM)
#pragma message("Including manual boot trim sequence for running on stand-alone device")
    manualBootTrim();
#endif
  
}
*/


/**************************************************************************//**
* @brief    Switches the HF source to XTAL
*
*           Contains the current initialization needed to switch to XTAL. This
*           includes some workaround for stabilizing the clock doubler.
*
* @return   None
******************************************************************************/

/*
enum InitLibStatus InitLib_switchToXtal(void)
{
  static uint32_t pSetupCmd[2] RF_CMD_MEM_LOCATION;
  static uint32_t pOverrides[9] RF_CMD_MEM_LOCATION;
  int_fast8_t overrideIndex;
  uint32_t CMDSTA_val = 0;
  
  //
  //Turn on clocks for AUX ADI and OSC TOP DDI to enable or check XOSC
  //CM3 goes to FaultISR if enabling AUX WUC clocks when AUX is powered down
  //from last program run (CC26_V1_BUG00090)
  //
  //Force AUX on in case it is off from last flash upload and run
  AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);
  //Wait until AUX is powered on
  while(!(AONWUCPowerStatus() & AONWUC_AUX_POWER_ON));

  //Enable clocks for OSC DDI and ADI
  AUXWUCClockEnable(AUX_WUC_OSCCTRL_CLOCK|AUX_WUC_ADI_CLOCK);
  
  //Enable OSC DIG interface to change clock sources
  OSCInterfaceEnable();

  //
  //Check to not enable XOSC if already enabled since OSCHFSourceSwitch() freezes
  //in loop waiting for clock ok signal
  //0: RCOSC, 1: XOSC
  //
  if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF)
  {

    //
    //Ugly Hack™ to remove clock doubler issue
    //

    //Enable RF Core power domain temporarily
    PRCMPowerDomainOn(PRCM_DOMAIN_RFCORE);

    while(PRCMPowerDomainStatus(PRCM_DOMAIN_RFCORE) != PRCM_DOMAIN_POWER_ON);
    // Enable clocks inside RF Core (non-buffered reg write, to make sure)
    //HWREG(RF24_PWR_NONBUF_BASE + RF24_PWR_O_PWMCLKENABLE) = 0x7FF; // all clocks
    HWREG(RFC_PWR_NONBUF_BASE + RFC_PWR_O_PWMCLKEN) = 0x7FF; // all clocks  
    
    // Make command for setting codrrect config
    memset(pSetupCmd, 0, SIZEOF_STRUCT(CMD_WRITE_FWPAR));
    GET_FIELD(pSetupCmd, command, commandNo) = CMD_WRITE_FWPAR;
    GET_FIELD(pSetupCmd, CMD_WRITE_FWPAR, address) = 0x106E;
    GET_FIELD(pSetupCmd, CMD_WRITE_FWPAR, value) = 0x0001;

    // Enable bias current in all modules to stay on even though modules are off (adds ??uA)
    // Set correct synth config value so that ADI1 can be written
    if ( ! RfSendCommandOk( (uint32_t) pSetupCmd, &CMDSTA_val )) {
      return InitLibStatus_RadioCommunicationError;
    }
    
    // Make override that configures ADI writes
    overrideIndex = 0;
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_RF_LDO_1 * 2, 
                           ADI_0_RF_RF_LDO_1_RFLDO_EN_BIAS_ONLY_M, 
                           ADI_0_RF_RF_LDO_1_RFLDO_EN_BIAS_ONLY_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_IFADC11 * 2,
                            ADI_0_RF_IFADC11_ENABLE_OVERRIDE_M,
                            ADI_0_RF_IFADC11_ENABLE_OVERRIDE_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_IFALDO1 * 2, 
                            ADI_0_RF_IFALDO1_IFANALDO_EN_BIAS_ONLY_M,
                            ADI_0_RF_IFALDO1_IFANALDO_EN_BIAS_ONLY_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_IFDLDO1 * 2, 
                            ADI_0_RF_IFDLDO1_IFDIGLDO_EN_BIAS_ONLY_M,
                            ADI_0_RF_IFDLDO1_IFDIGLDO_EN_BIAS_ONLY_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_CTL_LNA0 * 2,
                            ADI_0_RF_CTL_LNA0_EN_DMY_LNA_M,
                            ADI_0_RF_CTL_LNA0_EN_DMY_LNA_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_CTL_IFAMP0 * 2,
                            ADI_0_RF_CTL_IFAMP0_EN_DMY_IFAMP_M,
                            ADI_0_RF_CTL_IFAMP0_EN_DMY_IFAMP_M);
    pOverrides[overrideIndex++] = 
      ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_CTL_PA0 * 2, 
                           ADI_0_RF_CTL_PA0_EN_DMY_M,
                           ADI_0_RF_CTL_PA0_EN_DMY_M);
    pOverrides[overrideIndex++] = 
      ADI_2HALFREG_OVERRIDE(1, ADI_1_SYNTH_O_CTL_LDOVCO_1 * 2,
                            ADI_1_SYNTH_CTL_LDOVCO_1_LDOVCO_EN_BIAS_ONLY_M,
                            ADI_1_SYNTH_CTL_LDOVCO_1_LDOVCO_EN_BIAS_ONLY_M,
                            ADI_1_SYNTH_O_SLDO_1 * 2,
                            ADI_1_SYNTH_SLDO_1_SLDO_EN_BIAS_ONLY_M,
                            ADI_1_SYNTH_SLDO_1_SLDO_EN_BIAS_ONLY_M);   
    pOverrides[overrideIndex++] = END_OVERRIDE;


    // Make update setup command
    memset(pSetupCmd, 0, SIZEOF_STRUCT(CMD_UPDATE_RADIO_SETUP));
    GET_FIELD(pSetupCmd, command, commandNo) = CMD_UPDATE_RADIO_SETUP;
    GET_FIELD(pSetupCmd, CMD_UPDATE_RADIO_SETUP, pRegOverride) = pOverrides;
    // Send command that writes ADI
    if ( ! RfSendCommandOk( (uint32_t) pSetupCmd, &CMDSTA_val )) {
      return InitLibStatus_RadioCommunicationError;
    }


