ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/libraries/cc13xx_pg1_init_lib/cc13xx_pg1_init_lib.c
    HWREG(RF24_PWR_NONBUF_BASE + RF24_PWR_O_PWMCLKENABLE) = 0x0;
    PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE);
    while(PRCMPowerDomainStatus(PRCM_DOMAIN_RFCORE) != PRCM_DOMAIN_POWER_OFF);
     
    //
    //Ugly Hack™ end
    //
    
    // Request to switch to the crystal to enable radio operation.
    // It takes a while for the XTAL to be ready so it is possible to
    // perform other tasks while waiting.
    OSCClockSourceSet(OSC_SRC_CLK_LF | OSC_SRC_CLK_MF | OSC_SRC_CLK_HF,
                      OSC_XOSC_HF);


    //
    // Switch the HF source to XTAL - must be performed safely outside flash access to
    // avoid flash issues when switching the clock.
    //
    OSCHfSourceSwitch();
  }

  //Disable OSC DIG interface
  OSCInterfaceDisable();

  //Power off AUX
  AUXWUCPowerCtrl(AUX_WUC_POWER_OFF);

  //Wait until AUX is powered off
  while( (AONWUCPowerStatus() & AONWUC_AUX_POWER_ON) != 0);
  
  return InitLibStatus_Ok;
}
*/


enum InitLibStatus InitLib_startAndCalibrateSynth(uint32_t frequency, 
                                                  uint8_t divider,
                                                  enum InitLibRadioMode radioMode,
                                                  enum InitLibSynthMode synthMode,
                                                  uint32_t crystalFrequency)
{
  uint32_t CMDSTA_val;
  
  // Turn on clocks for FSCA MCE and RFE RAM to force enable of FSCA and RFE
  // clocks, to allow direct RFE reg access.
  if(!RfSendCommandOk(CMDR_DIR_CMD_2BYTE(
                        CMD_FORCE_CLK_ENA, 
                        //RF24_PWR_PWMCLKENABLE_FSCA | RF24_PWR_PWMCLKENABLE_RFE | RF24_PWR_PWMCLKENABLE_MDM), 
                        RFC_PWR_PWMCLKEN_FSCA | RFC_PWR_PWMCLKEN_RFE | RFC_PWR_PWMCLKEN_MDM),
                       &CMDSTA_val ))
    return InitLibStatus_Error;
  
  
  frequency = getCorrectPllFrequency(frequency, synthMode, radioMode);
  
  runFractionalResamplerBugFix(divider);
  
  //LH: Don't understand this right shifting of the freq.
  //turn_on_synth(CC13XX_MODE, frequency >> 16);
  turn_on_synth(CC26XX_MODE, frequency >> 16);
  
  /*calibrate_synth(CC13XX_MODE, 
                  (frequency >> 16), 
                  (frequency & 0xFFFF), 
                  divider, 
                  synthMode, 
                  crystalFrequency);*/
  
  calibrate_synth(CC26XX_MODE, 
                  (frequency >> 16), 
                  (frequency & 0xFFFF), 
                  divider, 
                  synthMode, 
                  crystalFrequency);
  
  
  if(pllCorrectionDone == 0)
    pllCorrectionDone = 1;
  
  return InitLibStatus_Ok;
}

void InitLib_shutdownSynth(void)
{
  turn_off_synth();
}

static uint32_t getCorrectPllFrequency(uint32_t frequency, enum InitLibSynthMode synthMode, enum InitLibRadioMode radioMode)
{
  uint8_t *pRadioCfg = (uint8_t *) 0x21000210; // address to CPE's internal radioCfg struct
  uint8_t test_watch = *pRadioCfg; //because cannot see the struct in the watch in its pointer form
  
  // The CMD_PROP_RADIO_SETUP should configure radio for either 0.25 MHz
  // (if narrow RX channel), 0.5 MHz or 1.0 MHz (wide RX channel filter).
  // Due to bug, the modisfcfg.txfoff setting (used in TX) is calculated
  // incorrectly, and CM3 must adjust this.
  uint32_t par_modIsfCfgVal = GET_FIELD(pRadioCfg, radioPar, modIsfCfgVal);
  
    // If MODISFCFG_TXFOFF_M is 0x000 this will always return 0?
    // If MODISFCFG_TXFOFF_M = 0xFFF, only the correct bits set to 1 would return non-zero
    if ((par_modIsfCfgVal & RF24_FSCA_MODISFCFG_TXFOFF_M) == 0) {
  
    // No TX freq offset after CMD_PROP_RADIO_SETUP. We will do no txfoff adjustment.
 } else {
  
    // Recalculate txfoff setting, based on mdmTxIntFreq, using correct Frf resolution
    uint32_t wantedTxIfFreq = GET_FIELD(pRadioCfg, radioPar, mdmTxIntFreq); // wanted IF freq, 20.12 MHz format
    uint32_t rfChannelFreq = frequency >> 4; // 20.12 MHz
    int32_t txfoff = ((wantedTxIfFreq << 19) / (rfChannelFreq >> 2)); // wantedTxIfFreq is by CPE max 1.0 MHz, so we need to avoid overflow
    
    if ((txfoff >= (1 << 11)) || (txfoff < -(1 << 11))) {
                     
      // New txfoff exceeds valid range (12bit, signed), will cause overflow. 
      // Can't support this TX IF setting, will change it to use 0 instead.
      GET_FIELD(pRadioCfg, radioPar, mdmTxIntFreq) = 0;
      txfoff = 0;
    }
    // Write back the new value
    par_modIsfCfgVal = (par_modIsfCfgVal & ~RF24_FSCA_MODISFCFG_TXFOFF_M) | ((txfoff << RF24_FSCA_MODISFCFG_TXFOFF_S) & RF24_FSCA_MODISFCFG_TXFOFF_M);
    GET_FIELD(pRadioCfg, radioPar, modIsfCfgVal) = par_modIsfCfgVal;
 }
  
  // Calculate the synth PLL frequency to use, compensated for IF setting.
  // physical freq on 16.16 MHz format
  uint32_t pllFrequency = frequency; 
  // Subtract the IF used by RFCore. This can be either 0.25, 0.5, or 1.0 MHz,
  // readable from internal mdmTxIntFreq or mdmRxIntfFreq variables in 4.12 MHz format.
  // (Typically, unless otherwise overridden, we can assume RX and TX IF are identical)
  // shift to get the IF into 16.16 format as well
  if (radioMode == InitLibRadioMode_CW) {
    // Do Nothing
  } else {
    if (synthMode == InitLibSynthMode_TX) {
      //synthesizer/modulator-related setting?
      pllFrequency -= ((uint32_t) GET_FIELD(pRadioCfg, radioPar, mdmTxIntFreq) << 4); 
    } else {
      pllFrequency -= ((uint32_t) GET_FIELD(pRadioCfg, radioPar, mdmRxIntFreq) << 4); 
    }
  }
  
  return pllFrequency;
}


static void runFractionalResamplerBugFix(uint8_t divider)
{
  // HACK: After CMD_FS, set new modem register P/Q values for fractional resampler.
  //       Seems like CM0 calculates wrong values (we must divide P/Q by factor divider/2, by multiplying Q).
  uint32_t qVal = (HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMFRAC3) << 16);

  qVal |= HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMFRAC2);
  qVal = (qVal * divider) >> 1;  // *(divider/2) //this sets qval to 0?
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMFRAC2) = qVal & 0xFFFF;
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMFRAC3) = qVal >> 16;
    
