ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/libraries/cc13xx_pg1_init_lib/cc13xx_pg1_init_lib.c
  // HACK: Override the dynamically calculated matched filter coefficients set by CM0,
  //       as they give low performance. Instead use the default values that exists in MCE patch code.
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMMAFI0) = 0x0000; // these values are good for 50kbps/25 kHz dev (=> modulation index h=1.0)
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMMAFI1) = 0x5014; // for 38.4/20 kHz (=> modulation index h= 1.04) these works too.
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMMAFI2) = 0x0050;
  HWREG(RF24_MDM_BASE + RF24_MDM_O_DEMMAFI3) = 0x0000;
}

//-----------------------------------------------------------------------------
// RfSendCommandOk
//
// Returns TRUE if command finished successfully (The command is finished
//    when CMDSTA!=0 and successfully if CMDSTA[7:0]==0x01)
// Send RF-command (ref. RF core HAL specification)
//-----------------------------------------------------------------------------
static uint_fast8_t RfSendCommandOk( uint32_t CMDR_val, uint32_t * pCMDSTA_val )
{
   uint32_t timeoutCount = 0;
   //HWREG( RF24_DBELL_BASE + RF24_DBELL_O_CMDR ) = CMDR_val;
   HWREG( RFC_DBELL_BASE + RFC_DBELL_O_CMDR ) = CMDR_val;
   do {
      //*pCMDSTA_val = HWREG( RF24_DBELL_BASE + RF24_DBELL_O_CMDSTA );
      *pCMDSTA_val = HWREG( RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA );
      if (++timeoutCount > 50000) {
         return 0; // Error
      }
   } while ( *pCMDSTA_val == CMDSTA_Pending );

   return (( *pCMDSTA_val & 0x80 ) == 0 );
}

/*******************************************************************************
* @fn      manualBootTrim
*
* @brief   Warning: There may be clashes with this trim and the startup trim
*
*          Do initial device configuration, i.e. configuring available
*          peripherals, and setting some default trim values. This
*          initialization should normally be done automatically by boot ROM at
*          start-up, so this function is only intended to be used on devices
*          without a functional boot ROM / trim settings.
*
*          This function assumes that AUX domain is already powered on, as
*          is default upon a boot.
*
*          This is a preliminary debug version. See NOTEs in code comments.
*
* @param   none
*
* @return  none
*******************************************************************************/
/*static void manualBootTrim(void)
{
  unsigned long ulSysctrl12Reset;
  volatile unsigned char delay;
  
  //
  // Force AUX on and enable clocks
  //
  //Force AUX on in case it is off from last flash upload and run
  AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);
  //Wait until AUX is powered on
  while(!(AONWUCPowerStatus() & AONWUC_AUX_POWER_ON));

  //Enable clocks for OSC DDI and ADI
  AUXWUCClockEnable(AUX_WUC_OSCCTRL_CLOCK|AUX_WUC_ADI_CLOCK);


  /* Perform device configuration normally done by boot ROM at startup */
  // Configure available peripherals, RAM size etc.
  // default reset value: CONFIG_RFC = 0x01    => RFCore enabled
  // default reset value: CONFIG_RET = 0xE7    => Retention enabled in most domains
  /*HWREG(PRCM_BASE + PRCM_O_CONFIG_SEC_DMA) = 0x0103;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_GPIO) = 0x01;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_GPTM) = 0x0F;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_I2C) = 0x01;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_UART) = 0x01;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_SSI) = 0x03;
  HWREG(PRCM_BASE + PRCM_O_CONFIG_I2S) = 0x01;*/
  // default reset value: CONFIG_RAMSIZE = 0x3 => 16 kB SRAM

  // NOTE: normally, after configuration, the boot ROM will typically lock
  //       the PRCM configuration, but we will not do that here


  /* Load analog trim settings */
     
  // ----- Default trim sequence copied from here: -----
  // http://webix.norway.design.ti.com/svn/lab/Kharon/Register%20files/Characterisation%20register%20files/CC26xx/Default_trim
  // NOTE: Copied 2013-08-12 -- comment says: "this is not finished yet, missing BOD trim"
  // NOTE: Trim settings are developed for nominal devices only.
    
  // -- Disable reset sources while trimming
  /*ulSysctrl12Reset = HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET);
  HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET) = 0x00;
    
  // --- SOC REFSYS trim ---
  // Trim BGAP
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_CTLSOCREFSYS3) = 0x01;
  // Latch in BGAP trim
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_CTLSOCREFSYS3) = 0x81;
  // Trim 0.8V vref
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_CTLSOCREFSYS2) = 0x40;
  delay = 255; while(--delay); // small delay!
  // Trim IREF to 4 uA
  HWREGB(ADI2_BASE + ADI_2_REFSYS_O_CTLSOCREFSYS0) = 0x1C;
  // Trim VDDS BOD (TBD)
  //HWREGB(ADI3_BASE + ADI_3_REFSYS_O_CTLSOCREFSYS) = 0xTBD; // TODO?
    
  // --- BATMON trim ---
  // Enable BATMON measurement
  HWREG(AON_BATMON_BASE + AON_BATMON_O_CONFIGURATION) = 0x01;
  // Write BATMON battery trim settings
  HWREG(AON_BATMON_BASE + AON_BATMON_O_BMONP0) = 0x1D;
  HWREG(AON_BATMON_BASE + AON_BATMON_O_BMONP1) = 0x24;
  // Write BATMON temperature trim settings
  HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP0) = 0x6D;
  HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP1) = 0x2E;
  HWREG(AON_BATMON_BASE + AON_BATMON_O_TEMPP2) = 0x06;
  // Enable BATMON calculation
  HWREG(AON_BATMON_BASE + AON_BATMON_O_CONFIGURATION) = 0x03;

  // --- DCDC 1A trim ---
  // Set VDDR to 1.7V
  // Note: Note that the trimming of CTRL_1 is done in the startup code.
  // Set VDDR sleep trim voltage
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDC_CTRL_2) = 0x19;
  // Set DC/DC driving strength to max
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDC_CTRL_5) = 0x3F;
  // Set DC/DC inductor peak current
  HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDC_CTRL_6) = 0x04;

  // --- SOC_LDO trim ---
  // Trim DIG_LDO & uLDO to 1.25V, BOD to 1.21V
  HWREGB(ADI2_BASE + ADI_2_REFSYS_O_SOCLDO_0_1) = 0xD0;
  // uLDO and BOD
  HWREGB(ADI2_BASE + ADI_2_REFSYS_O_SOCLDO_0_0) = 0x02;
  // Turn uLDO on
  // Note: Clashes with the current startup code which enables IREF
#if 0
  HWREGB(ADI2_BASE + ADI_2_REFSYS_O_SOCLDO_1_0) = 0x01;
#endif
  
  // --- OSC_TOP trim ---

  // Trim RCOSC to 48 MHz
  //HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_RCOSCHF_CTRL) = 0x00009400;
  // NOTE: If we apply the above RCOSCHF trim setting, there seems to be a
  //       problem with the IAR debugger losing contact when we're doing a
  //       reset-to-main in debug mode, so a different (lower) trim value has
  //       been chosen (temporary workaround). This does *NOT* provide 48 MHz
  //       clock frequency, probably closer to 30 MHz?
  //HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_RCOSCHF_CTRL) = 0x00005400;
  //Trying with the following sequence:
  if ( HWREG( AUX_OSCDDI_BASE + OSC_DIG_O_RCOSCHF_CTRL ) != 0x9400 ) {
    for ( uint32_t i = 0x5400 ; i <= 0x9400 ; i += 0x100 ) {
       HWREG( AUX_OSCDDI_BASE + OSC_DIG_O_RCOSCHF_CTRL ) = i;
       for ( volatile uint32_t j = 0 ; j < 1000 ; j++ ) {
          // Just use time :-)
       }
    }
  }

  // Trim NANOAMP_BIAS and enable it
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_ADC_DBLR_NANOAMP_CTRL) = 0x1F000000;
  // XOSC for use with OSC_DIG HPM/LPM control
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_RADC_EXTERNAL_CFG) = 0x403F4000;
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_AMPCOMP_CTRL) = 0x00713F27;
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_AMPCOMP_TH1) = 0x886876A4;
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_AMPCOMP_TH2) = 0x68880000;
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_ANABYPASS_VALUE1) = 0x000F0FFF;
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_ANABYPASS_VALUE2) = 0x000003FF;
  // Trim RCOSC_LF
  // Note: Clashes with startup code
#if 0
  HWREG(AUX_OSCDDI_BASE + OSC_DIG_O_XOSCLF_RCOSCLF_CTRL) = 0x000000D8;
#endif

  // ----- Default trim sequence end, re-enable reset sources -----
  HWREG(AON_SYSCTRL12_BASE + AON_SYSCTRL12_O_RESET) = ulSysctrl12Reset;
  
  
  //Disable AUX clocks again
  AUXWUCClockDisable(AUX_WUC_OSCCTRL_CLOCK|AUX_WUC_ADI_CLOCK);
  //Relase force on AUX
  AONWUCAuxWakeupEvent(AONWUC_AUX_ALLOW_SLEEP);
  //Power off AUX
  AUXWUCPowerCtrl(AUX_WUC_POWER_OFF);

  //Wait until AUX is powered off
  //TBD: Check if this works..
  while( (AONWUCPowerStatus() & AONWUC_AUX_POWER_ON) != 0);

  return;
}*/

/**************************************************************************//**
* Close the Doxygen group.
* @}
******************************************************************************/
